#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-07a43b2f08fcc8274]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0cc877ccb08ef6827]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=us-east-2]
module.vpc.aws_route_table.rt-pub: Refreshing state... [id=rtb-06f8471e54e011d3b]
module.vpc.aws_subnet.private-subnets[1]: Refreshing state... [id=subnet-0a3490ddccad196e2]
module.vpc.aws_internet_gateway_attachment.igw-attachment: Refreshing state... [id=igw-07a43b2f08fcc8274:vpc-0cc877ccb08ef6827]
module.vpc.aws_subnet.private-subnets[0]: Refreshing state... [id=subnet-0795d4b2fb322ed3a]
module.vpc.aws_subnet.public-subnets[1]: Refreshing state... [id=subnet-016c8589e07a513ec]
module.vpc.aws_subnet.public-subnets[0]: Refreshing state... [id=subnet-0ca704b23eb21659e]
aws_security_group.sg-host: Refreshing state... [id=sg-0a7dbef9b4e5824ab]
module.vpc.aws_route_table_association.rt-association-pub[1]: Refreshing state... [id=rtbassoc-046ded2f88f572c04]
module.vpc.aws_route_table_association.rt-association-pub[0]: Refreshing state... [id=rtbassoc-0caa14a1b09331f2f]
module.instance.aws_instance.instance: Refreshing state... [id=i-0a310ceca73d0552d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.instance-client.aws_instance.instance will be created
  + resource "aws_instance" "instance" {
      + ami                                  = "ami-0430580de6244e02e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0ca704b23eb21659e"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "poc-template-client"
          + "Project"     = "poc-template"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "poc-template-client"
          + "Project"     = "poc-template"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0a7dbef9b4e5824ab",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 10
          + volume_type           = "gp2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```
</details>
*Pushed by: @rogerio-calixto, Action: `pull_request`*